Dlubal.RFEM5.RadialDimension
Radial dimension parameters

Dlubal.RFEM5.RadialDimension.No
Number

Dlubal.RFEM5.RadialDimension.ID
Identifier

Dlubal.RFEM5.RadialDimension.Tag
Tag

Dlubal.RFEM5.RadialDimension.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.RadialDimension.LineNo
Circle or arc number

Dlubal.RFEM5.RadialDimension.Type
Radial dimension type

Dlubal.RFEM5.RadialDimension.View
View type

Dlubal.RFEM5.RadialDimension.ViewParameter
View parameter

Dlubal.RFEM5.RadialDimension.Offset
Offset

Dlubal.RFEM5.RadialDimension.Length
Length (read only)

Dlubal.RFEM5.RadialDimension.Symbol
Symbol

Dlubal.RFEM5.RadialDimension.UseTargetPoint
Use target point

Dlubal.RFEM5.RadialDimension.TargetPoint
Target point